In [1]:
import numpy as np
import pandas as pd

In [2]:
Books = pd.read_csv("./Book_data/new_data/Books.csv")
Users = pd.read_csv("./Book_data/new_data/Users.csv")
Ratings = pd.read_csv("./Book_data/new_data/Ratings.csv")

D:\Programs\envs\pytorch\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
#  将文件的ID以字典的形式换成数字
def replaceID_Num(rel_data, colum):
    id_n = {}
    count = 0
    for id in rel_data[colum]:
        if id in id_n:
            continue
        else:
            id_n[id] =count
            count += 1
    return id_n

In [4]:
# 找出某一列类型里元素重复出现的次数
def ID_Num(rel_data, u_data, colum):
    id_num= {}   # colum中元素重复出现的次数
    id_n = {}    # 为colum中元素重新定义下标，即为字典的值
    count = 0
    for id in u_data[colum]:
        id_num[id]=1
    for id in rel_data[colum]:
        if id in id_n:
            id_num[id] += 1
        else:
            id_n[id] =count
            count += 1
    return id_n,id_num

In [5]:
_, user_num = ID_Num(Ratings, Users, "User-ID")

In [6]:
rel = 0
Users_ID = set()
for i in user_num:
    if user_num[i] >= 5:
        rel += user_num[i]
        Users_ID.add(i)
print("用户数%d， 总交互数：%d" %(len(Users_ID), rel))

用户数10740， 总交互数：247628

In [7]:
Ratings

        User-ID        ISBN  Book-Rating
0        276729  0521795028            6
1        276744  038550120X            7
2        276747  0060517794            9
3        276747  0671537458            9
4        276747  0679776818            8
...         ...         ...          ...
321891   276704  0345386108            6
321892   276704  0743211383            7
321893   276704  1563526298            9
321894   276709  0515107662           10
321895   276721  0590442449           10

[321896 rows x 3 columns]

In [8]:
Ratings_5 = Ratings[Ratings["User-ID"].isin(Users_ID)]
Ratings_5

        User-ID        ISBN  Book-Rating
2        276747  0060517794            9
3        276747  0671537458            9
4        276747  0679776818            8
5        276747  0943066433            7
6        276747  1885408226            7
...         ...         ...          ...
321886   276688  0836218655           10
321887   276688  0836236688           10
321888   276688  0892966548           10
321889   276688  1551669315            6
321890   276688  1575660792            7

[247628 rows x 3 columns]

In [9]:
Books_ID = set()
for i in  Ratings_5['ISBN']:
    Books_ID.add(i)
print(len(Users_ID), len(Books_ID))
print("平均每个人交互的次数:",len(Ratings_5 )/len(Users_ID))

10740 111336
平均每个人交互的次数: 23.056610800744878

In [10]:
books = pd.read_csv("./Book_data/new_data/Books.csv")
users = pd.read_csv("./Book_data/new_data/Users.csv")
print(len(users),len(books))

61288 129014

D:\Programs\envs\pytorch\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [11]:
users = users[users["User-ID"].isin(Users_ID)]
books = books[books["ISBN"].isin(Books_ID)]
print(len(users),len(books))

10740 111336

In [12]:
Users_n,Books_n,Locations_n=  replaceID_Num(users, "User-ID"),replaceID_Num(books,"ISBN"),replaceID_Num(users,"Location")
Book_Author_n,Year_Publication_n,Publisher_n=  replaceID_Num(books, "Book-Author"),replaceID_Num(books,"Year-Of-Publication"),replaceID_Num(books,"Publisher")

In [13]:
print("length_all:users:%d, books:%d, locations:%d "  %(len(Users_n), len(Books_n), len(Locations_n)))
print("length_all:Book_Author:%d, Year_Publication:%d, Publisher:%d "  %(len(Book_Author_n), len(Year_Publication_n), len(Publisher_n)))

length_all:users:10740, books:111336, locations:4954
length_all:Book_Author:47288, Year_Publication:170, Publisher:9053

In [14]:
# 将目标文件的数据替换为对应的数字并写入文件
Users_filename = "./Book_data/new_data/Users_5.csv"
Ratings_filename = "./Book_data/new_data/Ratings_5.csv"
Books_filename = "./Book_data/new_data/Books_5.csv"

# Users
columns = []
f = open(Users_filename, "w")
for each in users.columns:
    columns.append(each)
f.write("User-ID" + ' ' + "Location" + ' ' + "Age" + '\n')  
for ID1,ID2,ID3 in zip(users[columns[0]],users[columns[1]],users[columns[2]]):
    f.write(str(Users_n[ID1]) + ' ' + str(Locations_n[ID2]) + ' ' + str(ID3) + '\n')   
f.close()

In [15]:
books.head(1)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [23]:
# Books
columns = []
f = open(Books_filename, "w")
for each in books.columns:
    columns.append(each)
f.write("ISBN" + ' ' + "Book-Author" + ' ' + "Year-Of-Publication" +  ' ' +  "Publisher" + '\n')  
for ID1,ID2,ID3,ID4 in zip(books[columns[0]],books[columns[2]],books[columns[3]], books[columns[4]]):
    f.write(str(Books_n[ID1]) + ' ' + str(Book_Author_n[ID2]) + ' ' + str(int(ID3)) + ' ' + str(Publisher_n[ID4]) +'\n')   
f.close()

# Books_n , Book_Author_n,Year_Publication_n,Publisher_n

In [24]:
Ratings_5.head(10)

    User-ID        ISBN  Book-Rating
2    276747  0060517794            9
3    276747  0671537458            9
4    276747  0679776818            8
5    276747  0943066433            7
6    276747  1885408226            7
26   276813  8423996565            8
27   276813  8426449476            8
28   276813  8426449573            6
29   276813  8478885218            6
30   276813  8478886044            8

In [25]:
# Rating
columns = []
f = open(Ratings_filename, "w")
for each in Ratings_5.columns:
    columns.append(each)
f.write("User-ID" + ' ' + "ISBN" + ' ' + "Book-Rating" + '\n')  
for ID1,ID2,ID3 in zip(Ratings_5[columns[0]],Ratings_5[columns[1]],Ratings_5[columns[2]]):
    f.write(str(Users_n[ID1]) + ' ' + str(Books_n[ID2])  + ' '+ str(ID3) +'\n')   
f.close()

In [26]:
# 将目标文件的数据替换为对应的数字并写入文件
def replaceData_Num(data, new_filename, new_ID1,new_ID2):   
    columns = []
    f  = open(new_filename, "w")
    for each in data.columns:
        columns.append(each)
    if len(columns) == 2:
        for ID1,ID2 in zip(data[columns[0]],data[columns[1]]):
    #     print(user_n[ID1],video_n[ID2])
            f.write(str(new_ID1[ID1]) + ' ' + str(new_ID2[ID2]) + '\n')
    else:
         for ID1 in data[columns[0]]:
            f.write(str(new_ID1[ID1]) + '\n')         
    f.close()

In [31]:
Books = pd.read_csv("./Book_data/new_data/Books_5.csv", sep = ' ')
Books

          ISBN  Book-Author  Year-Of-Publication  Publisher
0            0            0                 2001          0
1            1            1                 1991          1
2            2            2                 1999          2
3            3            3                 1991          3
4            4            4                 2000          4
...        ...          ...                  ...        ...
111331  111331         1763                 2001       9051
111332  111332        38829                 1989       7562
111333  111333         5641                 1978        304
111334  111334        47287                 2004       9052
111335  111335          266                 1988        975

[111336 rows x 4 columns]